design/AP-Requirements.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-03 Mon 20:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Requirements</title>
<meta name="author" content="Daniel Birket &amp; Lawrence Perez" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Software Requirements
<br />
<span class="subtitle">Audible-Plot</span>
</h1>
<div class="abstract" id="org2a6cb43">
<p>
This document specifies the requirements of a python module the
supports "plotting" simple data series as audible speech and tones,
together with a visual plot of the same data, with particular
attention to accessibility by visually-impaired and blind users.
</p>

</div>

<div id="outline-container-org04f2772" class="outline-2">
<h2 id="org04f2772"><span class="section-number-2">1.</span> Introduction</h2>
</div>
<div id="outline-container-org21ab224" class="outline-2">
<h2 id="org21ab224"><span class="section-number-2">2.</span> Project Goals</h2>
<div class="outline-text-2" id="text-2">
<p>
The purpose of this project goes beyond the creation of a python
module to audibly "plot" data. The project should also:
</p>

<ul class="org-ul">
<li>Provide the contributors with practice programming in the "Python"
language, including using libraries for:
<ul class="org-ul">
<li>Text to Speech</li>
<li>Audio synthesis</li>
</ul></li>
<li>Provide experience in designing and implementing an accessible program
and web site about that program.</li>
<li>Provide experience using software design tools, including:
<ul class="org-ul">
<li>Git version control</li>
<li>Static web site tools</li>
<li>Code documentation</li>
<li>Software Testing</li>
</ul></li>
<li>Provide an public repository for a professional résumé.</li>
</ul>
</div>
</div>

<div id="outline-container-org194eeb5" class="outline-2">
<h2 id="org194eeb5"><span class="section-number-2">3.</span> Module Requirements</h2>
<div class="outline-text-2" id="text-3">
<p>
The software module must meet the following requirements:
</p>

<ul class="org-ul">
<li>It must be suitable to the study of Algebra by blind and low-vision
students for whom the traditional manual and automated "graphing" of
linear and polynomial functions is not instructive. (This is the
use-case that prompted this project.)</li>

<li>It must be written primarily in the "Python" programming language,
as that language is well suited to both learning and production of a
professional product and is compatible with a range of platforms.</li>

<li>It must be open-source with a copy-left license.</li>

<li>It must be well and accessibly documented, so that others and blind
users in particular may benefit from it.</li>

<li>It must have a professional and high-quality appearance, to be
usable as a résumé portfolio reference.</li>

<li>It must be compatible with Linux/Unix platforms, including
particularly MacOS and Raspberry Pi, the platforms used by the
initial contributors.</li>

<li><p>
It must rely only on historically and currently well-maintained
dependencies to avoid becoming unusable due to broken dependencies
so as to remain useful to others longer.
</p>

<p>
Recommendations <span class="timestamp-wrapper"><span class="timestamp">[2023-03-28 Tue]</span></span>:
</p>

<ul class="org-ul">
<li>Current stable Python language: 3.11.2 at <a href="https://python.org">https://python.org</a></li>

<li>Gnuplot 5.4.6 at <a href="http://gnuplot.info">http://gnuplot.info</a>

<ul class="org-ul">
<li>I suggest writing gnuplot scripts directly and shelling out (or
piping) to run them, instead of using an available python wrapper,
as wrappers are less likely to be maintained than gnuplot itself.</li>
</ul></li>

<li>Pandoc 3.1.2 at <a href="https://pandoc.org">https://pandoc.org</a></li>
</ul></li>

<li>It must be usable with and without a "screen reader".</li>

<li>It should produce graphical, plain-text and audio representations of the
data and metadata.
<ul class="org-ul">
<li>I suggest 'pandoc markdown' format plain-text output of the metadata
(title, axis labels, ranges, etc) and tabular data as it easily
readable with a screen-reader or a text-to-speech engine, plus it is
readily convertible into HTML, PDF and other formats for sighted
users, and can embed graphics and links to audio files.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Birket &amp; Lawrence Perez</p>
<p class="date">Created: 2023-04-03 Mon 20:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>